## Plan Result (dev_apim)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 5 to destroy.</code></pre>

* Update
  * module.api-mgmt.azurerm_api_management.apim
* Delete
  * module.api-mgmt.azurerm_subnet.temp_subnet[0]
  * module.api-mgmt.azurerm_subnet_network_security_group_association.temp_nsg[0]
  * module.api-mgmt.azurerm_subnet_route_table_association.temp_subnet[0]
* Replace
  * module.api-mgmt.azurerm_api_management_custom_domain.api-management-custom-domain
  * module.api-mgmt.azurerm_role_assignment.apim




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.api-mgmt.data.azurerm_api_management.apim will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_api_management" "apim" {
      + additional_location       = (known after apply)
      + developer_portal_url      = (known after apply)
      + gateway_regional_url      = (known after apply)
      + gateway_url               = (known after apply)
      + hostname_configuration    = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + location                  = (known after apply)
      + management_api_url        = (known after apply)
      + name                      = "sds-api-mgmt-dev"
      + notification_sender_email = (known after apply)
      + portal_url                = (known after apply)
      + private_ip_addresses      = (known after apply)
      + public_ip_address_id      = (known after apply)
      + public_ip_addresses       = (known after apply)
      + publisher_email           = (known after apply)
      + publisher_name            = (known after apply)
      + resource_group_name       = "ss-dev-network-rg"
      + scm_url                   = (known after apply)
      + sku_name                  = (known after apply)
      + tenant_access             = (known after apply)
    }

  # module.api-mgmt.azurerm_api_management.apim will be updated in-place
  ~ resource "azurerm_api_management" "apim" {
        id                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-dev"
        name                          = "sds-api-mgmt-dev"
      - public_ip_address_id          = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/publicIPAddresses/sds-api-mgmt-dev-private-pip-temp" -> null
        tags                          = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
            "startupMode"  = "always"
        }
        # (21 unchanged attributes hidden)

      ~ virtual_network_configuration {
          ~ subnet_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/virtualNetworks/ss-dev-vnet/subnets/temp-migration-subnet" -> "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/virtualNetworks/ss-dev-vnet/subnets/api-management"
        }

        # (8 unchanged blocks hidden)
    }

  # module.api-mgmt.azurerm_api_management_custom_domain.api-management-custom-domain must be replaced
-/+ resource "azurerm_api_management_custom_domain" "api-management-custom-domain" {
      ~ api_management_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-dev" # forces replacement -> (known after apply) # forces replacement
      ~ id                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-dev/customDomains/default" -> (known after apply)

      ~ gateway {
          + certificate_source              = (known after apply)
          + certificate_status              = (known after apply)
          + expiry                          = (known after apply)
          + subject                         = (known after apply)
          + thumbprint                      = (known after apply)
            # (7 unchanged attributes hidden)
        }
      ~ gateway {
          + certificate_source              = (known after apply)
          + certificate_status              = (known after apply)
          + expiry                          = (known after apply)
          + subject                         = (known after apply)
          + thumbprint                      = (known after apply)
            # (7 unchanged attributes hidden)
        }
      ~ gateway {
          + certificate_source              = (known after apply)
          + certificate_status              = (known after apply)
          + expiry                          = (known after apply)
          + subject                         = (known after apply)
          + thumbprint                      = (known after apply)
            # (7 unchanged attributes hidden)
        }
    }

  # module.api-mgmt.azurerm_role_assignment.apim must be replaced
-/+ resource "azurerm_role_assignment" "apim" {
      ~ id                                     = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/sds-platform-dev-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsdev/providers/Microsoft.Authorization/roleAssignments/25a3f07c-a6f7-3eec-d1b8-5c0fe1b404e3" -> (known after apply)
      ~ name                                   = "25a3f07c-a6f7-3eec-d1b8-5c0fe1b404e3" -> (known after apply)
      ~ principal_id                           = "2be01751-8fa7-4e30-ade0-5a51322822ef" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.api-mgmt.azurerm_subnet.temp_subnet[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_subnet" "temp_subnet" {
      - address_prefixes                               = [
          - "10.145.35.0/24",
        ] -> null
      - enforce_private_link_endpoint_network_policies = true -> null
      - enforce_private_link_service_network_policies  = false -> null
      - id                                             = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/virtualNetworks/ss-dev-vnet/subnets/temp-migration-subnet" -> null
      - name                                           = "temp-migration-subnet" -> null
      - private_endpoint_network_policies_enabled      = false -> null
      - private_link_service_network_policies_enabled  = true -> null
      - resource_group_name                            = "ss-dev-network-rg" -> null
      - service_endpoint_policy_ids                    = [] -> null
      - service_endpoints                              = [] -> null
      - virtual_network_name                           = "ss-dev-vnet" -> null
    }

  # module.api-mgmt.azurerm_subnet_network_security_group_association.temp_nsg[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_subnet_network_security_group_association" "temp_nsg" {
      - id                        = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/virtualNetworks/ss-dev-vnet/subnets/temp-migration-subnet" -> null
      - network_security_group_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/networkSecurityGroups/sds-api-mgmt-dev-nsg" -> null
      - subnet_id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/virtualNetworks/ss-dev-vnet/subnets/temp-migration-subnet" -> null
    }

  # module.api-mgmt.azurerm_subnet_route_table_association.temp_subnet[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_subnet_route_table_association" "temp_subnet" {
      - id             = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/virtualNetworks/ss-dev-vnet/subnets/temp-migration-subnet" -> null
      - route_table_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/routeTables/sds-api-mgmt-dev-route-table" -> null
      - subnet_id      = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/virtualNetworks/ss-dev-vnet/subnets/temp-migration-subnet" -> null
    }

Plan: 2 to add, 1 to change, 5 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":779,"Program":"tfcmt","SHA1":"","Target":"dev_apim","Vars":{}} -->